52bluewhale/STM32F411RE_Bare_Metal/Src/013_i2c_slave_tx_string.c
#include <stdio.h>
#include <string.h>
#include "stm32f411xx.h"
#include "stm32f411xx_i2c_driver.h"
#include "stm32f411xx_gpio_driver.h"

#define SLAVE_ADDR                          0x68
#define MY_ADDR                             SLAVE_ADDR

// tx buffer
uint8_t Tx_buf[32] = "STM32 slave mode testing";

I2C_Handle_t I2C1Handle;

void delay (void)
{
    for (uint32_t i = 0; i < 500000 / 2; i++);
}

/*
 * PB6 -> SCL
 * PB9 -> SDA
 */
void I2C1_GPIOInits(void)
{
    GPIO_Handle_t I2CPins;

    I2CPins.pGPIOx = GPIOB;
    I2CPins.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_ALTFN;
    I2CPins.GPIO_PinConfig.GPIO_PinOPType = GPIO_OP_TYPE_OD;
    I2CPins.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_PIN_PU;
    I2CPins.GPIO_PinConfig.GPIO_PinAltFunMode = 4;
    I2CPins.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_FAST;

    // SCL
    I2CPins.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_6;
    GPIO_Init(&I2CPins);
}

void I2C1_Inits(void)
{
    I2C1Handle.I2C_Config.I2C_ACKControl = I2C_ACK_ENABLE;
    I2C1Handle.I2C_Config.I2C_DeviceAddress = MY_ADDR;
    I2C1Handle.I2C_Config.I2C_FMDutyCycle = I2C_FM_DUTY_2;
    I2C1Handle.I2C_Config.I2C_SCLSpeed = I2C_SCL_SPEED_SM;

    I2C_Init(&I2C1Handle);
}

void GPIO_ButtonInit(void)
{
    GPIO_Handle_t GPIO_BUTTON;
    GPIO_BUTTON.pGPIOx = GPIOC;
    GPIO_BUTTON.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_13;
    GPIO_BUTTON.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_IN;
    GPIO_BUTTON.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_FAST;
    GPIO_BUTTON.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_NO_PUPD;

    GPIO_Init(&GPIO_BUTTON);
}

int main()
{
    uint8_t command_code;
    uint8_t len;

    initialise_monitor_handles();

    printf("Application is running\n");

    I2C1_GPIOInits();
    I2C1_Inits();

    // I2C IRQ configurations 
    I2C_IRQInterruptConfig(IRQ_I2C1_EV, ENABLE);
    I2C_IRQInterruptConfig(IRQ_I2C1_ER, ENABLE);

    I2C_SlaveEnableDisableCallbackEvents(I2C1, ENABLE);

    // Enable I2C peripheral
    I2C_PeripheralControl(I2C1, ENABLE);

    // ACK control bit
    I2C_ManageACK(I2C1, I2C_ACK_ENABLE);

    while (1);

}

void I2C1_EV_IRQHandler()
{
    I2C_EV_IRQHandling(&I2C1Handle);
}

void I2C1_ER_IRQHandler()
{
    I2C_ER_IRQHandling(&I2C1Handle);
}

void I2C_ApplicationEventCallback(I2C_Handle_t *pI2CHandle, uint8_t AppEv)
{
    static uint8_t commandCode = 0;
    static uint8_t Cnt = 0;

    if (AppEv == I2C_EV_DATA_REQ)
    {
        // Master wants some data, slave have to send it
        if (commandCode == 0x51)
        {
            // send length information to mast
            I2C_SlaveSendData(pI2CHandle->pI2Cx, strlen((char*)Tx_buf));
        }
        else if (commandCode == 0x52)
        {
            // send content of Tx_buf
            I2C_SlaveSendData(pI2CHandle->pI2Cx, Tx_buf[Cnt++]);
        }
    }
    else if (AppEv == I2C_EV_DATA_RCV)
    {
        // Data is waiting for slave to read, slave has to read it
        commandCode = I2C_SlaveReceiveData(pI2CHandle->pI2Cx);
    }
    else if (AppEv == I2C_ERROR_AF)
    {
        // happen only during slave tx data
        // master send nack so slave shouldnt send more data
        commandCode = 0xff;
        Cnt = 0;
    }
    else if (AppEv == I2C_EV_STOP)
    {
        // happen only during slave reception
        // master has ended i2c communication with slave
    }
}